# tap "adoptopenjdk/openjdk"
tap "dbcli/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Spell checker
brew "aspell"
# GNU Standards-compliant Makefiles
brew "autoconf"
brew "automake"
brew "awscli"
# cat with syntax highlight
brew "bat"
brew "cmake"
brew "coreutils"
# Transfer URL
brew "curl"
brew "direnv"
# Internationalitation and localization
brew "gettext"
# Needed for some ZI packages
brew "go"
# Privacy package (tools for signing, verifying, etc)
brew "gnupg"
# curl for gRPC servers
brew "grpcurl"
# Improved top (interactive process viewer)
brew "htop"
# Postgres C API library
brew "libpq", link: true
# C library implementing the SSH2 protocol
brew "libssh2"
brew "libyaml"
brew "lua"
brew "macvim"
# MySql client on steroids (https://www.mycli.net/)
brew "mycli"
# Open source relational database management system
brew "mysql-client"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Postgres CLI with auto-completion and syntax highlighting (https://www.pgcli.com)
brew "pgcli"
# Compile .proto files
brew "protobuf"
brew "python@3.8"
brew "readline"
# Grep on esteroids
brew "ripgrep"
brew "telnet"
# Terminal multiplexer
brew "tmux"
brew "tmux-mem-cpu-load"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
# brew "yarn" # Use asdf
# UNIX shell (command interpreter)
brew "zsh"
## Casks
cask "alfred"
cask "brave-browser"
cask "caffeine"
cask "docker"
cask "emacs"
#cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "postman"
cask "scroll-reverser"
cask "smcfancontrol"
cask "spotify"
cask "tableplus"
cask "the-unarchiver"
cask "visual-studio-code"
