tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Improved top (interactive process viewer)
brew "htop"
# Postgres C API library
brew "libpq", link: true
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source relational database management system
brew "mysql-client"
# Python version management
brew "pyenv"
# Terminal multiplexer
brew "tmux"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
cask "adoptopenjdk/openjdk/adoptopenjdk8"
cask "alfred"
cask "atom"
cask "caffeine"
cask "docker"
cask "iterm2"
cask "java"
cask "postman"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
